--Додається 10 працівників в таблицю worker

INSERT INTO worker
(name, birthday, level, salary)
VALUES
    ('Bohdan', '1990-08-09', 'Senior', 5500),
    ('Alex', '1980-03-01', 'Senior', 5000),
    ('Inna', '1990-03-07', 'Senior', 4500),
    ('Pavel', '1995-12-17', 'Middle', 3000),
    ('Roman', '1989-01-22', 'Middle', 3000),
    ('Alex', '1995-01-04', 'Middle', 3300),
    ('Max', '1998-11-30', 'Junior', 1800), 
    ('Sergey', '2000-11-28', 'Junior', 1500),
    ('Gregor', '2000-02-01', 'Trainee', 1000),
    ('Angela', '1999-07-03', 'Trainee', 800);    

--Додається 5 клієнтів в таблицю client

INSERT INTO client
(name)
VALUES
    ('Alcatel'), 
    ('MediaLux'), 
    ('Netflix'),
    ('Foxtrot'),
    ('Moyo');  

--Додається 10 проєктів в таблицю project

INSERT INTO project 
(client_id, start_date, finish_date)
VALUES
    (1, '2023-03-17', '2023-05-30'),
    (2, '2023-04-10', '2024-09-07'),
    (2, '2023-04-10', '2025-11-01'),
    (3, '2023-01-01', '2026-01-01'),
    (3, '2023-02-01', '2025-08-09'),
    (3, '2023-02-01', '2025-12-01'),
    (4, '2023-06-11', '2027-06-11'), 
    (4, '2023-07-01', '2028-07-01'),
    (5, '2023-05-01', '2024-05-01'),
    (5, '2023-05-01', '2024-01-01');    

--Назначення працівників на проєкт

INSERT INTO project_worker
(project_id, worker_id)
VALUES
    (1, 1), (1, 4), (1, 7),   
    (2, 2), (2, 5),
    (3, 3), (3, 6), (3, 9), 
    (4, 1), (4, 8),
    (5, 3), (5, 8), (5, 9),
    (6, 2), (6, 6), (6, 9),
    (7, 1),
    (8, 5), (8, 4),
    (9, 3), (9, 6), (9, 10),
    (10, 4), (10, 10);